# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\JeffSnyder\dev\Electrobass_embedded\slider\Electrobass_slider\Electrobass_slider.cydsn\Electrobass_slider.cyprj
# Date: Mon, 15 Aug 2022 16:43:02 GMT
#set_units -time ns
create_clock -name {EZI2C_SCBCLK(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {EZI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]


# Component constraints for C:\Users\JeffSnyder\dev\Electrobass_embedded\slider\Electrobass_slider\Electrobass_slider.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\JeffSnyder\dev\Electrobass_embedded\slider\Electrobass_slider\Electrobass_slider.cydsn\Electrobass_slider.cyprj
# Date: Mon, 15 Aug 2022 16:42:57 GMT
